[
 {
   "sp_student_ID": 95533296,
   "sp_title": "Drone landing stations in residential areas and city centres to allow aerial autonomous vehicle (AAV) travel to transport passengers",
   "sp_supervisor_ID": "mq15533296",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "Development of mechatronic systems for safe passenger access and egress in landing stations, and the control of platforms for AAV take-off and landing",
   "sp_description": "A concept has been developed in an international patent by a start-up company called Zambelli Imagineering Pty Ltd, which has been founded by my parents. This patent concept introduces drone landing stations in residential areas and city centres to allow aerial autonomous vehicle (AAV) travel to transport passengers.\nI would like to further the concept from the patent, and develop the mechatronic systems as follows:\n- ordering of a drone from a smart phone to come to the nearest available drone station\n- portable residential drone landing station\n- High rise building drone landing station\nThe mechatronic systems development will require the learnings from my second and third year engineering units to come up with a solution. I will also be able to draw on the experiences I have gained at two internships with robotics and automation companies over the last 3 years.",
   "sp_skills": "Knowledge of robotics, mechatronics, CAD, microcontroller programming, Python",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "22/2/2022 17:59"
 },
 {
   "sp_student_ID": 95391351,
   "sp_title": "Pattern Matching in PureScript",
   "sp_supervisor_ID": "mq15985915",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "Where does PureScript’s implementation of pattern matching fit in the broader universe of pattern matching implementations?  Are there any unique or rare features?",
   "sp_description": "We will investigate the pattern matching implementation of PureScript across multiple axis.  We will be guided in this by unpublished work that creates a framework in which to understand various pattern matching implementations.  We hypothesise that PureScript has some genuinely innovative features and expect to be able to illuminate their operation via this method.  It is hoped that other languages would then have a path to implementing the innovative features of pattern matching found in PureScript.",
   "sp_skills": "Pass mark in COMP3000",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "26/2/2022 21:39"
 },
 {
   "sp_student_ID": 95525005,
   "sp_title": "Using formal methods to check the correctness of control algorithms",
   "sp_supervisor_ID": "mq15391351",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "Control theory is a mathematically-based approach to the creation of systems that maintain certain properties in the presence of unknown inputs.  However, modern control systems are code, not formulas or hardware.  We wish to find out if any of the mathematically demonstrated properties are violated in live control systems and to correct those errors.",
   "sp_description": "We will take a commonly used Control System (PX4, which is used in drones) and subject it to known formal methods to determine if it achieves _stability_.  We expect we will need to invent new applications of formal methods to achieve this.\n\nIf we achieve this, we will have:\n  * improved a widely used code base\n  * developed a new, generally applicable, approach to applying formal methods in an important field (autonomous systems).",
   "sp_skills": "DMTH2097\nCOMP3000",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "28/2/2022 17:47"
 },
 {
   "sp_student_ID": 95792895,
   "sp_title": "Hull design and Testing for Unmanned Survey Vehicles.",
   "sp_supervisor_ID": "mq15792815",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "What combination of characteristics create a hull most suitable for unmanned surface vehicle use?",
   "sp_description": "We take a novel problem description and research possible optimal solutions to the problem.  The problem description is “we require an unmanned surface vehicle, which can carry a variety of sensors (both under and above water).  The vehicle must be controlled by two independent propulsion systems, both with rudders and will be capable of “skid steering”.  The vehicle must minimise disturbance that will affect the sensors even during manoeuvring.  The vehicle must be large enough to carry the sensors (approximately 2m).  Sensor disturbances to be minimised are (at least):\n  * underwater turbulence at the sensor sites\n  * pitch and roll\n  * unexpected acceleration\n\nIt is desirable to be able to travel both quickly (without concern for disturbance) as well as at a slower speed when minimal disturbance is desired\nIn this project we will work on _hull design_ for this problem statement.  We will assume solutions to the propulsion and guidance problems.\n\nWe hope to achieve field trials to demonstrate the extent to which each characteristic has been achieved.",
   "sp_skills": "-",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "1/3/2022 11:34"
 },
 {
   "sp_student_ID": 95238278,
   "sp_title": "Using sound and vibration to pre-determine mechanical faults in combustion engines",
   "sp_supervisor_ID": "mq21164971",
   "sp_co_supervisor_ID": "mq15533296",
   "sp_research_question": "Can we develop a system that is able to filter and seperate mechanical noise of an engine's moving components, allowing for easy diagnosis if we create a database of expected waveforms?",
   "sp_description": "Would it be possible to use tools such as the fourier transform to obtain waveform outputs which can be split up into simpler waveforms that represent different rotating/moving parts of an engine? From this can we determine if there are abnormalities in the function of the parts and replace them before they cause failures which can damage other components?\nThis could also be applied to other mechanical systems with moving/rotating parts.",
   "sp_skills": "Mechatronic, Mechanical",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "3/3/2022 17:53"
 },
 {
   "sp_student_ID": 95607796,
   "sp_title": "Autonomous AGV with Indoor Navigation",
   "sp_supervisor_ID": "mq15533296",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "How accurate can absolute position be using a fusion of off-the-shelf sensors such as a magnetometer and a range sensor, without the use of GPS.",
   "sp_description": "Design and build an Autonomous Ground Vehicle (AGV) which can localise it position indoors without the need for GPS, navigate to a waypoint and locate a QR Code. It will use sensors for collision avoidance, mapping and detection of a QR Code.",
   "sp_skills": "Sensor fusion, navigation, mapping, collision avoidance, computer vision",
   "sp_additional_skills": "DC Motor, motor driver, servo, range sensor, IMU, Python, software, data structures",
   "sp_required_labs": "",
   "sp_date_submitted": "3/3/2022 22:06"
 },
 {
   "sp_student_ID": 88164971,
   "sp_title": "Co-bots for manufacturing industries",
   "sp_supervisor_ID": "mq15533296",
   "sp_co_supervisor_ID": "mq21613415",
   "sp_research_question": "can co-bots load stacks of cardboard on a carton bed eliminating the need for manual handling in warehouses",
   "sp_description": "Companies such as Lion Tooheys and Visy that require operators to manually load stacks of cardboard onto a machine bed can be eliminate with the use of a co-bot",
   "sp_skills": "modelling via CAD\ngreat access to environment making it easy to research.",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "3/3/2022 23:25"
 },
 {
   "sp_student_ID": 95956022,
   "sp_title": "Roadmap to sustainable material recovery from End of life PV panels",
   "sp_supervisor_ID": "mq15533296",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "Solar PV Recycling",
   "sp_description": "Solar PV Recycling",
   "sp_skills": "Mechanical",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "4/3/2022 15:17"
 },
 {
   "sp_student_ID": 88613415,
   "sp_title": "Developing Mobile GIS for FAIMS",
   "sp_supervisor_ID": "mq15391351",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "What is the most optimum solution for mobile GIS for FAIMS requirements?",
   "sp_description": "Developing a GIS for the FAIMS application to be used in the field ",
   "sp_skills": "JavaScript, Github, React, web/mobile applications",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "4/3/2022 17:04"
 },
 {
   "sp_student_ID": 95634092,
   "sp_title": "Industry Based Project : \"Slot-less motor viscometrical applications\"",
   "sp_supervisor_ID": "mq15792815",
   "sp_co_supervisor_ID": "mq15472165",
   "sp_research_question": "How well does a slot-less motor perform when used to analyze viscosity in starch samples? ",
   "sp_description": "The RVA (rapid viscosity analyzer) currently utilizes a slotted motor to obtain the viscometrical properties of starch samples. Given the smooth-running characteristics of a slot-less motor its implementation in the RVA system promises more accurate readings of viscous characteristics in centipoise cp. This will be proven by simulating the operation of the system with the motor and prototyping of it to compare results from the current RVA and the slot-less motor viscos-analyzer. ",
   "sp_skills": "Circuit design, Simulation (Simulink), Motor control and sensing, and Wiring. ",
   "sp_additional_skills": "PLD microcontroller programming ",
   "sp_required_labs": "Mechatronics labs ",
   "sp_date_submitted": "4/3/2022 17:22"
 },
 {
   "sp_student_ID": 86510605,
   "sp_title": "Digital Optimisation and Technologic Transformation of a Small Manufacturing and Materials Processing Business [Case Study]",
   "sp_supervisor_ID": "mq21164971",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "How can Technology and Digitisation Strategies for a Small Material Processing Businesses be Effectively Designed and Implemented to Improve Manufacturing Efficiency and Reduce Operating Costs? ",
   "sp_description": "To determine the ideal way of transforming small manufacturing businesses to compete in the digital world by digitally optimising the business structure.\nThis will be tested by implementing the strategies developed into a small business and determining the impacts and evaluating their effectiveness\n",
   "sp_skills": "Websites, Microsoft Suite, AutoCAD, SolidWorks, Excel, IT/Databases/Servers, IoT",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "4/3/2022 17:50"
 },
 {
   "sp_student_ID": 95169179,
   "sp_title": "Optimal base station, geolocation by clustering methods",
   "sp_supervisor_ID": "mq15156022",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "What techniques are available to use clustering to determine the optimal base station locations for a cellular network providing wireless radio coverage for a set of user locations?",
   "sp_description": "In this project base stations are connected to the larger switching centre and the problem is the find out the geolocation of the base station. So, we have the users with the particular set of location and the task is to determine the optimal base station locations for a cellular network providing wireless radio coverage for a set of user locations. Maximum distance of the base station is the constrain into this project and the goal is to find out the maximum distance of the base station and the user, without using too many base stations. ",
   "sp_skills": "MATLAB",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "4/3/2022 22:39"
 },
 {
   "sp_student_ID": 95889910,
   "sp_title": "Design and Optimisation of pressure vessels",
   "sp_supervisor_ID": "mq21613415",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "How can the design of various pressure vessels be optimized?",
   "sp_description": "The objective of design optimization of pressure vessels is cost reduction by reducing weight with adequate strength and stiffness. Various pressure vessels of different designs are taken into consideration and the best options are evaluated.",
   "sp_skills": "#NAME?",
   "sp_additional_skills": "",
   "sp_required_labs": "-44 WTR Campus Laboratory\n- Main Campus Laboratory",
   "sp_date_submitted": "4/3/2022 22:13"
 },
 {
   "sp_student_ID": 95630216,
   "sp_title": "Motor alignment to the Astronomical Almanac",
   "sp_supervisor_ID": "mq15634092",
   "sp_co_supervisor_ID": "",
   "sp_research_question": "Can a combination of sensors and image processing be used to identify a particular star and control a 3-axis head to allow for clear images of the night sky?",
   "sp_description": "When photographing the night sky, long exposure times are required for high signal to noise ratio images. However, the Earth's rotation causes the stars to trail and blur in this time period. This presents a problem, in which a system with a 3-axis motorised head could be applied. The Astronomical Almanac provides a suitable reference frame to underly this motor control system. A combination of sensors and image processing is proposed to be used to automatically and precisely align the motors. The end goal of this applied motor system is to easily capture clear, long exposures of the night sky.",
   "sp_skills": "Motor control, microprocessors, camera and astronomy basic understanding",
   "sp_additional_skills": "",
   "sp_required_labs": "",
   "sp_date_submitted": "4/3/2022 23:02"
 }
]
