[
    {
      "p_ID": 41,
      "p_supervisor": "mq15156022",
      "p_size": 1,
      "p_title": "irreversible hydrodynamics",
      "p_description": "The supervisor  works with Physicsts and mathematicians to explore the fundamental behavior of particles in fluids. We currently have an interest in the interaction of a neutrally buoyant sphere and s fixed cylindrical obstacle. The project is to design and build an experimental flow cell to enable precise observation of the interaction.\n",
      "p_research_question": "Under what conditions to particles at low Reynolds number exhibit irreversible dynamics",
      "p_fields": "Mechanical",
      "p_co_supervisor": "",
      "p_industry_topic": false,
      "p_industry_supervisor": "",
      "p_type": "Undergraduate",
      "p_lab_access": "14SCOA-338-Cleanroom;9WW-218-1: Biomedical",
      "p_skills": "microscopy",
      "p_status": "available"
    },
    {
      "p_ID": 108,
      "p_supervisor": "mq15156022",
      "p_size": 1,
      "p_title": "Deep and scalable anomaly detection for software quality assurance",
      "p_description": "Deep learning is a widely adopted machine learning model due to its powerful learning capability and has attracted a lot attention from both academia and industry. It is of practical importance to incorporate deep learning models into software quality assurance process. Specifically, anomaly detection methods can be used to detect vulnerabilities in software in order to enhance the software quality. This project aims to explore the state-of-the-art deep anomaly detection models and propose a new type deep learning model based on forest data structure while existing models are mainly based on artificial neural networks. This project requires you to do literature review, design and develop algorithms, conduct experiment, and write reports.",
      "p_research_question": "Can we design and develop a deep and scalable machine learning model for anomaly detection to assure software quality during the software development lifecycle?  ",
      "p_fields": "Computer;Software",
      "p_co_supervisor": "",
      "p_industry_topic": false,
      "p_industry_supervisor": "",
      "p_type": "Undergraduate",
      "p_lab_access": "",
      "p_skills": "Second-year programming",
      "p_status": "available"
    },
    {
      "p_ID": 175,
      "p_supervisor": "mq15156022",
      "p_size": 1,
      "p_title": "UV nanosensor for skin cancer prevention ",
      "p_description": "UV radiation is the highest energy component of the solar spectrum reaching the earth’s surface. UV-light increases the synthesis of vitamin D in the skin which is an essential compound for many metabolic processes. However, UV radiation is also the most important environmental factor in developing skin cancer. There are three types of classified UV radiation according to their wavelength including UVA, UVB and UVC. Among all the rays, UVC has the shortest wavelength and is the most dangerous one but these rays do not reach the earth’s surface as they are completely absorbed by the ozone layer. However, both UVA and UVB reach the earth’s surface and play an important role in conditions such as premature skin aging, eye damage, and skin cancers\nThis project aims to fabricate a new generation of highly responsive wearable sensors which can be easily attached our smart watches and can measure the UV dosage absorbed by our skin to improve sun safety and prevent skin cancer.",
      "p_research_question": "How to synthesis a fingertip sized UV sensor?",
      "p_fields": "",
      "p_co_supervisor": "",
      "p_industry_topic": false,
      "p_industry_supervisor": "",
      "p_type": "Undergraduate",
      "p_lab_access": "",
      "p_skills": "o\tAptitude for innovative problem solving,\no\tAbility to adapt and learn in a challenging lab environment.\no\tGeneral understanding of wet chemistry is desirable",
      "p_status": "available"
    },
    {
      "p_ID": 214,
      "p_supervisor": "mq15156022",
      "p_size": 1,
      "p_title": "Tracking Malicious Cryptocurrency Transaction",
      "p_description": "One of the overarching goals of cryptocurrencies was to provide complete anonymity of all parties involved in a financial transaction, in a manner similar to what is achieved in a cash based transaction. Cryptocurrencies such as Bitcoin partially achieve this via the use of pseudonymous transactions, but the public record of transactions on the blockchain may result in re-identification via network or graph analysis. As a result, there are many privacy enhancing techniques such as the use of mixers (or tumblers), or entire cryptocurrencies such as Zcash built on encrypted blockchains using advanced zero-knowledge protocols from cryptography (zk-SNARKs).\n\nThe high-level of privacy makes it hard to trace transactions to real-world identities. This undoubtedly has some societal benefits, such as enabling people to send donations to human rights organisations in oppressed regimes. However, at the same time this also enables criminals such as money launderers, ransomware writers, drug and human traffickers to erase their online trace making it hard for law enforcement to attribute criminal activities to individuals.\n\nThe goal of this project is to analyse the security properties of anonymity techniques used in modern cryptocurrencies such as mixers and zk-SNARKs. The project will investigate technique(s) that could potentially de-anonymize end-to-end transactions.",
      "p_research_question": "Can malicious transactions, e.g., ransom payment, be traced under privacy enhanced techniques such as mixing services and zk-SNARKs used in modern cryptocurrencies?",
      "p_fields": "Computer;Software",
      "p_co_supervisor": "mq15219910",
      "p_industry_topic": false,
      "p_industry_supervisor": "",
      "p_type": "Undergraduate",
      "p_lab_access": "",
      "p_skills": "Familiarity with Blockchain, Cryptography, Python or C++",
      "p_status": "available"
    },
    {
      "p_ID": 148,
      "p_supervisor": "mq15156022",
      "p_size": 2,
      "p_title": "Augmented Audio Reality",
      "p_description": "The idea of overlaying virtual sounds on top of the real-world has been around since the 1990s. However, this idea has seen limited application. With an increasing interest in virtual environments by companies such as Meta, this may be a good time to understand and explore the issues hindering the augmentation of virtual and real worlds. In this project, you will identify the issues and challenges that might be hindering augmented reality, and will work towards a solution or increasing our understanding of the problems and challenges.  \n\nIf you are interested in this topic, you must email Alan for a meeting prior to add this project to your preferences.",
      "p_research_question": "How can we augment virtual and real worlds?",
      "p_fields": "",
      "p_co_supervisor": "",
      "p_industry_topic": false,
      "p_industry_supervisor": "",
      "p_type": "Undergraduate",
      "p_lab_access": "",
      "p_skills": "You must have received a Credit or above in ELEC2040/ELEC240 Signals and Systems or MTRN2060/ELEC260 Introduction to Mechatronics, and ELEC3042/ELEC342 Embedded Systems; Requires MATLAB, C and/or Arduino programming skills; Experience with breadboarding a",
      "p_status": "available"
    }
   ]
   